online-throughput/k3/tp-results-eagle3/bench-eagle3-c2.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f5a49b7d6c0>, seed=0, num_prompts=50, dataset_name='hf', no_stream=False, dataset_path='likaixin/InstructCoder', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=2, model='meta-llama/Llama-3.3-70B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-e610a395-', top_p=1.0, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             2         
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  70.15     
Total input tokens:                      8501      
Total generated tokens:                  7318      
Request throughput (req/s):              0.71      
Output token throughput (tok/s):         104.31    
Peak output token throughput (tok/s):    42.00     
Peak concurrent requests:                5.00      
Total token throughput (tok/s):          225.49    
---------------Time to First Token----------------
Mean TTFT (ms):                          166.00    
Median TTFT (ms):                        165.98    
P99 TTFT (ms):                           197.37    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.63     
Median TPOT (ms):                        17.04     
P99 TPOT (ms):                           24.48     
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.42     
Median ITL (ms):                         49.09     
P99 ITL (ms):                            69.14     
---------------Speculative Decoding---------------
Acceptance rate (%):                     60.00     
Acceptance length:                       2.80      
Drafts:                                  2609      
Draft tokens:                            7827      
Accepted tokens:                         4696      
Per-position acceptance (%):
  Position 0:                            75.01     
  Position 1:                            58.53     
  Position 2:                            46.45     
==================================================